TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Tue Oct 18 11:54:35 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Magnetometer.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("vTaskDelay")

    1746                            .dwattr $C$DW$160, DW_AT_name("eIncrement")
    1747                            .dwattr $C$DW$160, DW_AT_const_value(0x02)
    1748                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1749                            .dwattr $C$DW$160, DW_AT_decl_line(0x7e)
    1750                            .dwattr $C$DW$160, DW_AT_decl_column(0x02)
    1751                    
    1752                    $C$DW$161       .dwtag  DW_TAG_enumerator
    1753                            .dwattr $C$DW$161, DW_AT_name("eSetValueWithOverwrite")
    1754                            .dwattr $C$DW$161, DW_AT_const_value(0x03)
    1755                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1756                            .dwattr $C$DW$161, DW_AT_decl_line(0x7f)
    1757                            .dwattr $C$DW$161, DW_AT_decl_column(0x02)
    1758                    
    1759                    $C$DW$162       .dwtag  DW_TAG_enumerator
    1760                            .dwattr $C$DW$162, DW_AT_name("eSetValueWithoutOverwrite")
    1761                            .dwattr $C$DW$162, DW_AT_const_value(0x04)
    1762                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1763                            .dwattr $C$DW$162, DW_AT_decl_line(0x80)
    1764                            .dwattr $C$DW$162, DW_AT_decl_column(0x02)
    1765                    
    1766                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1767                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x7b)
    1768                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    1769                            .dwendtag $C$DW$T$87
    1770                    
    1771                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1772                            .dwattr $C$DW$T$88, DW_AT_name("eNotifyAction")
    1773                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1774                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1775                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1776                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x81)
    1777                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1778                    
    1779                    
    1780                    $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
    1781                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    1782                    $C$DW$163       .dwtag  DW_TAG_enumerator
    1783                            .dwattr $C$DW$163, DW_AT_name("eAbortSleep")
    1784                            .dwattr $C$DW$163, DW_AT_const_value(0x00)
    1785                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   35

    1786                            .dwattr $C$DW$163, DW_AT_decl_line(0xb5)
    1787                            .dwattr $C$DW$163, DW_AT_decl_column(0x02)
    1788                    
    1789                    $C$DW$164       .dwtag  DW_TAG_enumerator
    1790                            .dwattr $C$DW$164, DW_AT_name("eStandardSleep")
    1791                            .dwattr $C$DW$164, DW_AT_const_value(0x01)
    1792                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1793                            .dwattr $C$DW$164, DW_AT_decl_line(0xb6)
    1794                            .dwattr $C$DW$164, DW_AT_decl_column(0x02)
    1795                    
    1796                    $C$DW$165       .dwtag  DW_TAG_enumerator
    1797                            .dwattr $C$DW$165, DW_AT_name("eNoTasksWaitingTimeout")
    1798                            .dwattr $C$DW$165, DW_AT_const_value(0x02)
    1799                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1800                            .dwattr $C$DW$165, DW_AT_decl_line(0xb7)
    1801                            .dwattr $C$DW$165, DW_AT_decl_column(0x02)
    1802                    
    1803                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1804                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb4)
    1805                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x01)
    1806                            .dwendtag $C$DW$T$89
    1807                    
    1808                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1809                            .dwattr $C$DW$T$90, DW_AT_name("eSleepModeStatus")
    1810                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1811                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1812                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1813                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xb8)
    1814                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1815                    
    1816                    
    1817                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1818                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1819                    $C$DW$166       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1821                            .dwattr $C$DW$166, DW_AT_name("ui8Addr")
    1822                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ui8Addr")
    1823                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1826                            .dwattr $C$DW$166, DW_AT_decl_line(0x4c)
    1827                            .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    1828                    
    1829                    $C$DW$167       .dwtag  DW_TAG_member
    1830                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    1831                            .dwattr $C$DW$167, DW_AT_name("pui8WriteData")
    1832                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pui8WriteData")
    1833                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1834                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1835                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1836                            .dwattr $C$DW$167, DW_AT_decl_line(0x51)
    1837                            .dwattr $C$DW$167, DW_AT_decl_column(0x14)
    1838                    
    1839                    $C$DW$168       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   36

    1841                            .dwattr $C$DW$168, DW_AT_name("ui16WriteCount")
    1842                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("ui16WriteCount")
    1843                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1844                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1845                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1846                            .dwattr $C$DW$168, DW_AT_decl_line(0x56)
    1847                            .dwattr $C$DW$168, DW_AT_decl_column(0x0e)
    1848                    
    1849                    $C$DW$169       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
    1851                            .dwattr $C$DW$169, DW_AT_name("ui16WriteBatchSize")
    1852                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1853                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1854                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1856                            .dwattr $C$DW$169, DW_AT_decl_line(0x5b)
    1857                            .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    1858                    
    1859                    $C$DW$170       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    1861                            .dwattr $C$DW$170, DW_AT_name("pui8ReadData")
    1862                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("pui8ReadData")
    1863                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1864                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1866                            .dwattr $C$DW$170, DW_AT_decl_line(0x60)
    1867                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1868                    
    1869                    $C$DW$171       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    1871                            .dwattr $C$DW$171, DW_AT_name("ui16ReadCount")
    1872                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui16ReadCount")
    1873                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1874                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1876                            .dwattr $C$DW$171, DW_AT_decl_line(0x65)
    1877                            .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1878                    
    1879                    $C$DW$172       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
    1881                            .dwattr $C$DW$172, DW_AT_name("ui16ReadBatchSize")
    1882                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1883                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1884                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1886                            .dwattr $C$DW$172, DW_AT_decl_line(0x6a)
    1887                            .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1888                    
    1889                    $C$DW$173       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$28)
    1891                            .dwattr $C$DW$173, DW_AT_name("pfnCallback")
    1892                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("pfnCallback")
    1893                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1894                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   37

    1896                            .dwattr $C$DW$173, DW_AT_decl_line(0x6f)
    1897                            .dwattr $C$DW$173, DW_AT_decl_column(0x16)
    1898                    
    1899                    $C$DW$174       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$3)
    1901                            .dwattr $C$DW$174, DW_AT_name("pvCallbackData")
    1902                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("pvCallbackData")
    1903                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1904                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1906                            .dwattr $C$DW$174, DW_AT_decl_line(0x74)
    1907                            .dwattr $C$DW$174, DW_AT_decl_column(0x0b)
    1908                    
    1909                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1910                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1911                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1912                            .dwendtag $C$DW$T$29
    1913                    
    1914                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1915                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1916                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1917                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1918                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1919                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1920                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1921                    
    1922                    
    1923                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1924                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1925                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1926                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1927                    $C$DW$175       .dwtag  DW_TAG_subrange_type
    1928                            .dwattr $C$DW$175, DW_AT_upper_bound(0x09)
    1929                    
    1930                            .dwendtag $C$DW$T$31
    1931                    
    1932                    
    1933                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1934                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1935                    $C$DW$176       .dwtag  DW_TAG_member
    1936                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$24)
    1937                            .dwattr $C$DW$176, DW_AT_name("ui32Base")
    1938                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ui32Base")
    1939                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1941                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1942                            .dwattr $C$DW$176, DW_AT_decl_line(0x82)
    1943                            .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    1944                    
    1945                    $C$DW$177       .dwtag  DW_TAG_member
    1946                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1947                            .dwattr $C$DW$177, DW_AT_name("ui8Int")
    1948                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui8Int")
    1949                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1950                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   38

    1951                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1952                            .dwattr $C$DW$177, DW_AT_decl_line(0x87)
    1953                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    1954                    
    1955                    $C$DW$178       .dwtag  DW_TAG_member
    1956                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1957                            .dwattr $C$DW$178, DW_AT_name("ui8TxDMA")
    1958                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ui8TxDMA")
    1959                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1960                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1961                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1962                            .dwattr $C$DW$178, DW_AT_decl_line(0x8c)
    1963                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    1964                    
    1965                    $C$DW$179       .dwtag  DW_TAG_member
    1966                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1967                            .dwattr $C$DW$179, DW_AT_name("ui8RxDMA")
    1968                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("ui8RxDMA")
    1969                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1970                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1971                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1972                            .dwattr $C$DW$179, DW_AT_decl_line(0x91)
    1973                            .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    1974                    
    1975                    $C$DW$180       .dwtag  DW_TAG_member
    1976                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1977                            .dwattr $C$DW$180, DW_AT_name("ui8State")
    1978                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("ui8State")
    1979                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1980                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1981                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1982                            .dwattr $C$DW$180, DW_AT_decl_line(0x96)
    1983                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    1984                    
    1985                    $C$DW$181       .dwtag  DW_TAG_member
    1986                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1987                            .dwattr $C$DW$181, DW_AT_name("ui8ReadPtr")
    1988                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8ReadPtr")
    1989                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1990                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1991                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1992                            .dwattr $C$DW$181, DW_AT_decl_line(0x9c)
    1993                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    1994                    
    1995                    $C$DW$182       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1997                            .dwattr $C$DW$182, DW_AT_name("ui8WritePtr")
    1998                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui8WritePtr")
    1999                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2000                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2002                            .dwattr $C$DW$182, DW_AT_decl_line(0xa2)
    2003                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    2004                    
    2005                    $C$DW$183       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   39

    2006                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2007                            .dwattr $C$DW$183, DW_AT_name("ui16Index")
    2008                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui16Index")
    2009                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2010                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2011                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2012                            .dwattr $C$DW$183, DW_AT_decl_line(0xa7)
    2013                            .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    2014                    
    2015                    $C$DW$184       .dwtag  DW_TAG_member
    2016                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    2017                            .dwattr $C$DW$184, DW_AT_name("pCommands")
    2018                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("pCommands")
    2019                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2020                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2021                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2022                            .dwattr $C$DW$184, DW_AT_decl_line(0xac)
    2023                            .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    2024                    
    2025                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2026                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    2027                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2028                            .dwendtag $C$DW$T$32
    2029                    
    2030                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2031                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2032                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2033                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2034                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2035                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2036                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2037                    
    2038                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2039                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2040                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2041                    
    2042                    
    2043                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2044                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2045                    $C$DW$185       .dwtag  DW_TAG_member
    2046                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$34)
    2047                            .dwattr $C$DW$185, DW_AT_name("psI2CInst")
    2048                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("psI2CInst")
    2049                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2052                            .dwattr $C$DW$185, DW_AT_decl_line(0xf0)
    2053                            .dwattr $C$DW$185, DW_AT_decl_column(0x14)
    2054                    
    2055                    $C$DW$186       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$35)
    2057                            .dwattr $C$DW$186, DW_AT_name("pui8Buffer")
    2058                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("pui8Buffer")
    2059                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2060                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   40

    2061                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2062                            .dwattr $C$DW$186, DW_AT_decl_line(0xf5)
    2063                            .dwattr $C$DW$186, DW_AT_decl_column(0x0d)
    2064                    
    2065                    $C$DW$187       .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2067                            .dwattr $C$DW$187, DW_AT_name("ui8State")
    2068                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("ui8State")
    2069                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2070                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2072                            .dwattr $C$DW$187, DW_AT_decl_line(0xfa)
    2073                            .dwattr $C$DW$187, DW_AT_decl_column(0x0d)
    2074                    
    2075                    $C$DW$188       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2077                            .dwattr $C$DW$188, DW_AT_name("ui8Addr")
    2078                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("ui8Addr")
    2079                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2080                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2081                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2082                            .dwattr $C$DW$188, DW_AT_decl_line(0xff)
    2083                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2084                    
    2085                    $C$DW$189       .dwtag  DW_TAG_member
    2086                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2087                            .dwattr $C$DW$189, DW_AT_name("ui16Mask")
    2088                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui16Mask")
    2089                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2090                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2091                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2092                            .dwattr $C$DW$189, DW_AT_decl_line(0x104)
    2093                            .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2094                    
    2095                    $C$DW$190       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$22)
    2097                            .dwattr $C$DW$190, DW_AT_name("ui16Value")
    2098                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ui16Value")
    2099                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2100                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2102                            .dwattr $C$DW$190, DW_AT_decl_line(0x109)
    2103                            .dwattr $C$DW$190, DW_AT_decl_column(0x0e)
    2104                    
    2105                    $C$DW$191       .dwtag  DW_TAG_member
    2106                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$28)
    2107                            .dwattr $C$DW$191, DW_AT_name("pfnCallback")
    2108                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("pfnCallback")
    2109                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2110                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2112                            .dwattr $C$DW$191, DW_AT_decl_line(0x10f)
    2113                            .dwattr $C$DW$191, DW_AT_decl_column(0x16)
    2114                    
    2115                    $C$DW$192       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   41

    2116                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$3)
    2117                            .dwattr $C$DW$192, DW_AT_name("pvCallbackData")
    2118                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pvCallbackData")
    2119                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2120                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2121                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2122                            .dwattr $C$DW$192, DW_AT_decl_line(0x114)
    2123                            .dwattr $C$DW$192, DW_AT_decl_column(0x0b)
    2124                    
    2125                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2126                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2127                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2128                            .dwendtag $C$DW$T$36
    2129                    
    2130                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2131                            .dwattr $C$DW$T$91, DW_AT_name("tI2CMReadModifyWrite16")
    2132                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
    2133                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2134                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2135                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x116)
    2136                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    2137                    
    2138                    $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    2139                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2140                            .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    2141                    
    2142                    
    2143                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2144                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2145                    $C$DW$193       .dwtag  DW_TAG_member
    2146                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$34)
    2147                            .dwattr $C$DW$193, DW_AT_name("psI2CInst")
    2148                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("psI2CInst")
    2149                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2151                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2152                            .dwattr $C$DW$193, DW_AT_decl_line(0x123)
    2153                            .dwattr $C$DW$193, DW_AT_decl_column(0x14)
    2154                    
    2155                    $C$DW$194       .dwtag  DW_TAG_member
    2156                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$37)
    2157                            .dwattr $C$DW$194, DW_AT_name("pui8Buffer")
    2158                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pui8Buffer")
    2159                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2160                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2161                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2162                            .dwattr $C$DW$194, DW_AT_decl_line(0x128)
    2163                            .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    2164                    
    2165                    $C$DW$195       .dwtag  DW_TAG_member
    2166                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2167                            .dwattr $C$DW$195, DW_AT_name("ui16Count")
    2168                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui16Count")
    2169                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2170                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   42

    2171                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2172                            .dwattr $C$DW$195, DW_AT_decl_line(0x12d)
    2173                            .dwattr $C$DW$195, DW_AT_decl_column(0x0e)
    2174                    
    2175                    $C$DW$196       .dwtag  DW_TAG_member
    2176                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    2177                            .dwattr $C$DW$196, DW_AT_name("pui8Data")
    2178                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("pui8Data")
    2179                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2180                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2181                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2182                            .dwattr $C$DW$196, DW_AT_decl_line(0x132)
    2183                            .dwattr $C$DW$196, DW_AT_decl_column(0x14)
    2184                    
    2185                    $C$DW$197       .dwtag  DW_TAG_member
    2186                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$28)
    2187                            .dwattr $C$DW$197, DW_AT_name("pfnCallback")
    2188                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("pfnCallback")
    2189                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2190                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2191                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2192                            .dwattr $C$DW$197, DW_AT_decl_line(0x137)
    2193                            .dwattr $C$DW$197, DW_AT_decl_column(0x16)
    2194                    
    2195                    $C$DW$198       .dwtag  DW_TAG_member
    2196                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$3)
    2197                            .dwattr $C$DW$198, DW_AT_name("pvCallbackData")
    2198                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("pvCallbackData")
    2199                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2200                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2201                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2202                            .dwattr $C$DW$198, DW_AT_decl_line(0x13c)
    2203                            .dwattr $C$DW$198, DW_AT_decl_column(0x0b)
    2204                    
    2205                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2206                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2207                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2208                            .dwendtag $C$DW$T$38
    2209                    
    2210                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2211                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    2212                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    2213                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2214                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2215                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    2216                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2217                    
    2218                    
    2219                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2220                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2221                    $C$DW$199       .dwtag  DW_TAG_member
    2222                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$34)
    2223                            .dwattr $C$DW$199, DW_AT_name("psI2CInst")
    2224                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("psI2CInst")
    2225                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   43

    2226                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2227                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2228                            .dwattr $C$DW$199, DW_AT_decl_line(0xbc)
    2229                            .dwattr $C$DW$199, DW_AT_decl_column(0x14)
    2230                    
    2231                    $C$DW$200       .dwtag  DW_TAG_member
    2232                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$35)
    2233                            .dwattr $C$DW$200, DW_AT_name("pui8Buffer")
    2234                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pui8Buffer")
    2235                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2236                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2237                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2238                            .dwattr $C$DW$200, DW_AT_decl_line(0xc1)
    2239                            .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2240                    
    2241                    $C$DW$201       .dwtag  DW_TAG_member
    2242                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2243                            .dwattr $C$DW$201, DW_AT_name("ui8State")
    2244                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("ui8State")
    2245                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2246                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2247                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2248                            .dwattr $C$DW$201, DW_AT_decl_line(0xc6)
    2249                            .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    2250                    
    2251                    $C$DW$202       .dwtag  DW_TAG_member
    2252                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2253                            .dwattr $C$DW$202, DW_AT_name("ui8Addr")
    2254                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ui8Addr")
    2255                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2256                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2257                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2258                            .dwattr $C$DW$202, DW_AT_decl_line(0xcb)
    2259                            .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2260                    
    2261                    $C$DW$203       .dwtag  DW_TAG_member
    2262                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2263                            .dwattr $C$DW$203, DW_AT_name("ui8Mask")
    2264                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ui8Mask")
    2265                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2266                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2267                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2268                            .dwattr $C$DW$203, DW_AT_decl_line(0xd0)
    2269                            .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2270                    
    2271                    $C$DW$204       .dwtag  DW_TAG_member
    2272                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2273                            .dwattr $C$DW$204, DW_AT_name("ui8Value")
    2274                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("ui8Value")
    2275                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2276                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2277                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2278                            .dwattr $C$DW$204, DW_AT_decl_line(0xd5)
    2279                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2280                    
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   44

    2281                    $C$DW$205       .dwtag  DW_TAG_member
    2282                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$28)
    2283                            .dwattr $C$DW$205, DW_AT_name("pfnCallback")
    2284                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("pfnCallback")
    2285                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2286                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2287                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2288                            .dwattr $C$DW$205, DW_AT_decl_line(0xdb)
    2289                            .dwattr $C$DW$205, DW_AT_decl_column(0x16)
    2290                    
    2291                    $C$DW$206       .dwtag  DW_TAG_member
    2292                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$3)
    2293                            .dwattr $C$DW$206, DW_AT_name("pvCallbackData")
    2294                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pvCallbackData")
    2295                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2296                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2297                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2298                            .dwattr $C$DW$206, DW_AT_decl_line(0xe0)
    2299                            .dwattr $C$DW$206, DW_AT_decl_column(0x0b)
    2300                    
    2301                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2302                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2303                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2304                            .dwendtag $C$DW$T$39
    2305                    
    2306                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2307                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    2308                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    2309                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2310                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2311                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    2312                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2313                    
    2314                    
    2315                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2316                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2317                    $C$DW$207       .dwtag  DW_TAG_member
    2318                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$34)
    2319                            .dwattr $C$DW$207, DW_AT_name("psI2CInst")
    2320                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("psI2CInst")
    2321                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2323                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2324                            .dwattr $C$DW$207, DW_AT_decl_line(0x32)
    2325                            .dwattr $C$DW$207, DW_AT_decl_column(0x14)
    2326                    
    2327                    $C$DW$208       .dwtag  DW_TAG_member
    2328                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2329                            .dwattr $C$DW$208, DW_AT_name("ui8Addr")
    2330                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("ui8Addr")
    2331                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2332                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2333                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2334                            .dwattr $C$DW$208, DW_AT_decl_line(0x37)
    2335                            .dwattr $C$DW$208, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   45

    2336                    
    2337                    $C$DW$209       .dwtag  DW_TAG_member
    2338                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2339                            .dwattr $C$DW$209, DW_AT_name("ui8State")
    2340                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("ui8State")
    2341                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2342                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2343                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2344                            .dwattr $C$DW$209, DW_AT_decl_line(0x3c)
    2345                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2346                    
    2347                    $C$DW$210       .dwtag  DW_TAG_member
    2348                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$40)
    2349                            .dwattr $C$DW$210, DW_AT_name("pui8Data")
    2350                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("pui8Data")
    2351                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2352                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2353                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2354                            .dwattr $C$DW$210, DW_AT_decl_line(0x41)
    2355                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2356                    
    2357                    $C$DW$211       .dwtag  DW_TAG_member
    2358                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$28)
    2359                            .dwattr $C$DW$211, DW_AT_name("pfnCallback")
    2360                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("pfnCallback")
    2361                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2362                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2363                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2364                            .dwattr $C$DW$211, DW_AT_decl_line(0x47)
    2365                            .dwattr $C$DW$211, DW_AT_decl_column(0x16)
    2366                    
    2367                    $C$DW$212       .dwtag  DW_TAG_member
    2368                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$3)
    2369                            .dwattr $C$DW$212, DW_AT_name("pvCallbackData")
    2370                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pvCallbackData")
    2371                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2372                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2373                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2374                            .dwattr $C$DW$212, DW_AT_decl_line(0x4c)
    2375                            .dwattr $C$DW$212, DW_AT_decl_column(0x0b)
    2376                    
    2377                    $C$DW$213       .dwtag  DW_TAG_member
    2378                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$51)
    2379                            .dwattr $C$DW$213, DW_AT_name("uCommand")
    2380                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("uCommand")
    2381                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2382                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2383                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2384                            .dwattr $C$DW$213, DW_AT_decl_line(0x64)
    2385                            .dwattr $C$DW$213, DW_AT_decl_column(0x05)
    2386                    
    2387                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2388                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2389                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2390                            .dwendtag $C$DW$T$41
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   46

    2391                    
    2392                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2393                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2394                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2395                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2396                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2397                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2398                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2399                    
    2400                    
    2401                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2402                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2403                    $C$DW$214       .dwtag  DW_TAG_member
    2404                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$34)
    2405                            .dwattr $C$DW$214, DW_AT_name("psI2CInst")
    2406                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("psI2CInst")
    2407                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2409                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2410                            .dwattr $C$DW$214, DW_AT_decl_line(0x33)
    2411                            .dwattr $C$DW$214, DW_AT_decl_column(0x14)
    2412                    
    2413                    $C$DW$215       .dwtag  DW_TAG_member
    2414                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$42)
    2415                            .dwattr $C$DW$215, DW_AT_name("sAK8975Inst")
    2416                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("sAK8975Inst")
    2417                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2418                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2419                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2420                            .dwattr $C$DW$215, DW_AT_decl_line(0x38)
    2421                            .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2422                    
    2423                    $C$DW$216       .dwtag  DW_TAG_member
    2424                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2425                            .dwattr $C$DW$216, DW_AT_name("ui8Addr")
    2426                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("ui8Addr")
    2427                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2428                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2429                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2430                            .dwattr $C$DW$216, DW_AT_decl_line(0x3d)
    2431                            .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2432                    
    2433                    $C$DW$217       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2435                            .dwattr $C$DW$217, DW_AT_name("ui8State")
    2436                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("ui8State")
    2437                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2438                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2439                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2440                            .dwattr $C$DW$217, DW_AT_decl_line(0x42)
    2441                            .dwattr $C$DW$217, DW_AT_decl_column(0x0d)
    2442                    
    2443                    $C$DW$218       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2445                            .dwattr $C$DW$218, DW_AT_name("ui8AccelAfsSel")
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   47

    2446                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2447                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2448                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2450                            .dwattr $C$DW$218, DW_AT_decl_line(0x47)
    2451                            .dwattr $C$DW$218, DW_AT_decl_column(0x0d)
    2452                    
    2453                    $C$DW$219       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2455                            .dwattr $C$DW$219, DW_AT_name("ui8NewAccelAfsSel")
    2456                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2457                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2458                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2460                            .dwattr $C$DW$219, DW_AT_decl_line(0x4d)
    2461                            .dwattr $C$DW$219, DW_AT_decl_column(0x0d)
    2462                    
    2463                    $C$DW$220       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2465                            .dwattr $C$DW$220, DW_AT_name("ui8GyroFsSel")
    2466                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2467                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2468                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2470                            .dwattr $C$DW$220, DW_AT_decl_line(0x52)
    2471                            .dwattr $C$DW$220, DW_AT_decl_column(0x0d)
    2472                    
    2473                    $C$DW$221       .dwtag  DW_TAG_member
    2474                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2475                            .dwattr $C$DW$221, DW_AT_name("ui8NewGyroFsSel")
    2476                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2477                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2478                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2479                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2480                            .dwattr $C$DW$221, DW_AT_decl_line(0x58)
    2481                            .dwattr $C$DW$221, DW_AT_decl_column(0x0d)
    2482                    
    2483                    $C$DW$222       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$43)
    2485                            .dwattr $C$DW$222, DW_AT_name("pui8Data")
    2486                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pui8Data")
    2487                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2488                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2489                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2490                            .dwattr $C$DW$222, DW_AT_decl_line(0x5d)
    2491                            .dwattr $C$DW$222, DW_AT_decl_column(0x0d)
    2492                    
    2493                    $C$DW$223       .dwtag  DW_TAG_member
    2494                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$28)
    2495                            .dwattr $C$DW$223, DW_AT_name("pfnCallback")
    2496                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("pfnCallback")
    2497                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2498                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2499                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2500                            .dwattr $C$DW$223, DW_AT_decl_line(0x63)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   48

    2501                            .dwattr $C$DW$223, DW_AT_decl_column(0x16)
    2502                    
    2503                    $C$DW$224       .dwtag  DW_TAG_member
    2504                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$3)
    2505                            .dwattr $C$DW$224, DW_AT_name("pvCallbackData")
    2506                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("pvCallbackData")
    2507                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2508                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2509                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2510                            .dwattr $C$DW$224, DW_AT_decl_line(0x68)
    2511                            .dwattr $C$DW$224, DW_AT_decl_column(0x0b)
    2512                    
    2513                    $C$DW$225       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$53)
    2515                            .dwattr $C$DW$225, DW_AT_name("uCommand")
    2516                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("uCommand")
    2517                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2518                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2520                            .dwattr $C$DW$225, DW_AT_decl_line(0x80)
    2521                            .dwattr $C$DW$225, DW_AT_decl_column(0x05)
    2522                    
    2523                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2524                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2525                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2526                            .dwendtag $C$DW$T$44
    2527                    
    2528                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2529                            .dwattr $C$DW$T$93, DW_AT_name("tMPU9150")
    2530                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$44)
    2531                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2532                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2533                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x82)
    2534                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2535                    
    2536                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2537                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2538                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    2539                    
    2540                    
    2541                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2542                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2543                    $C$DW$226       .dwtag  DW_TAG_member
    2544                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$10)
    2545                            .dwattr $C$DW$226, DW_AT_name("fd")
    2546                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("fd")
    2547                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2549                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2550                            .dwattr $C$DW$226, DW_AT_decl_line(0x5c)
    2551                            .dwattr $C$DW$226, DW_AT_decl_column(0x0b)
    2552                    
    2553                    $C$DW$227       .dwtag  DW_TAG_member
    2554                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$45)
    2555                            .dwattr $C$DW$227, DW_AT_name("buf")
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   49

    2556                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("buf")
    2557                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2558                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2560                            .dwattr $C$DW$227, DW_AT_decl_line(0x5d)
    2561                            .dwattr $C$DW$227, DW_AT_decl_column(0x16)
    2562                    
    2563                    $C$DW$228       .dwtag  DW_TAG_member
    2564                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$45)
    2565                            .dwattr $C$DW$228, DW_AT_name("pos")
    2566                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("pos")
    2567                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2568                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2569                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2570                            .dwattr $C$DW$228, DW_AT_decl_line(0x5e)
    2571                            .dwattr $C$DW$228, DW_AT_decl_column(0x16)
    2572                    
    2573                    $C$DW$229       .dwtag  DW_TAG_member
    2574                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$45)
    2575                            .dwattr $C$DW$229, DW_AT_name("bufend")
    2576                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("bufend")
    2577                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2578                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2579                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2580                            .dwattr $C$DW$229, DW_AT_decl_line(0x5f)
    2581                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2582                    
    2583                    $C$DW$230       .dwtag  DW_TAG_member
    2584                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$45)
    2585                            .dwattr $C$DW$230, DW_AT_name("buff_stop")
    2586                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("buff_stop")
    2587                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2588                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2589                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2590                            .dwattr $C$DW$230, DW_AT_decl_line(0x60)
    2591                            .dwattr $C$DW$230, DW_AT_decl_column(0x16)
    2592                    
    2593                    $C$DW$231       .dwtag  DW_TAG_member
    2594                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$11)
    2595                            .dwattr $C$DW$231, DW_AT_name("flags")
    2596                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("flags")
    2597                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2598                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2599                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2600                            .dwattr $C$DW$231, DW_AT_decl_line(0x61)
    2601                            .dwattr $C$DW$231, DW_AT_decl_column(0x16)
    2602                    
    2603                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2604                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2605                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2606                            .dwendtag $C$DW$T$46
    2607                    
    2608                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2609                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2610                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$46)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   50

    2611                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2612                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2613                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2614                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2615                    
    2616                    
    2617                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2618                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    2619                    $C$DW$232       .dwtag  DW_TAG_member
    2620                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$34)
    2621                            .dwattr $C$DW$232, DW_AT_name("psI2CInst")
    2622                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("psI2CInst")
    2623                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2625                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2626                            .dwattr $C$DW$232, DW_AT_decl_line(0x14c)
    2627                            .dwattr $C$DW$232, DW_AT_decl_column(0x14)
    2628                    
    2629                    $C$DW$233       .dwtag  DW_TAG_member
    2630                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
    2631                            .dwattr $C$DW$233, DW_AT_name("pui8Data")
    2632                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("pui8Data")
    2633                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2634                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2635                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2636                            .dwattr $C$DW$233, DW_AT_decl_line(0x151)
    2637                            .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    2638                    
    2639                    $C$DW$234       .dwtag  DW_TAG_member
    2640                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
    2641                            .dwattr $C$DW$234, DW_AT_name("ui16Count")
    2642                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("ui16Count")
    2643                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2644                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2645                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2646                            .dwattr $C$DW$234, DW_AT_decl_line(0x156)
    2647                            .dwattr $C$DW$234, DW_AT_decl_column(0x0e)
    2648                    
    2649                    $C$DW$235       .dwtag  DW_TAG_member
    2650                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$28)
    2651                            .dwattr $C$DW$235, DW_AT_name("pfnCallback")
    2652                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("pfnCallback")
    2653                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2654                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2655                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2656                            .dwattr $C$DW$235, DW_AT_decl_line(0x15b)
    2657                            .dwattr $C$DW$235, DW_AT_decl_column(0x16)
    2658                    
    2659                    $C$DW$236       .dwtag  DW_TAG_member
    2660                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$3)
    2661                            .dwattr $C$DW$236, DW_AT_name("pvCallbackData")
    2662                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("pvCallbackData")
    2663                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2664                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2665                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   51

    2666                            .dwattr $C$DW$236, DW_AT_decl_line(0x160)
    2667                            .dwattr $C$DW$236, DW_AT_decl_column(0x0b)
    2668                    
    2669                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2670                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x147)
    2671                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2672                            .dwendtag $C$DW$T$47
    2673                    
    2674                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2675                            .dwattr $C$DW$T$96, DW_AT_name("tI2CMRead16BE")
    2676                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
    2677                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2678                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2679                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x162)
    2680                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2681                    
    2682                    
    2683                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2684                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    2685                    $C$DW$237       .dwtag  DW_TAG_member
    2686                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$34)
    2687                            .dwattr $C$DW$237, DW_AT_name("psI2CInst")
    2688                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("psI2CInst")
    2689                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2690                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2691                            .dwattr $C$DW$237, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2692                            .dwattr $C$DW$237, DW_AT_decl_line(0x170)
    2693                            .dwattr $C$DW$237, DW_AT_decl_column(0x14)
    2694                    
    2695                    $C$DW$238       .dwtag  DW_TAG_member
    2696                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$37)
    2697                            .dwattr $C$DW$238, DW_AT_name("pui8Buffer")
    2698                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("pui8Buffer")
    2699                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2700                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$238, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2702                            .dwattr $C$DW$238, DW_AT_decl_line(0x175)
    2703                            .dwattr $C$DW$238, DW_AT_decl_column(0x0d)
    2704                    
    2705                    $C$DW$239       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$22)
    2707                            .dwattr $C$DW$239, DW_AT_name("ui16Count")
    2708                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("ui16Count")
    2709                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2710                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2711                            .dwattr $C$DW$239, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2712                            .dwattr $C$DW$239, DW_AT_decl_line(0x17a)
    2713                            .dwattr $C$DW$239, DW_AT_decl_column(0x0e)
    2714                    
    2715                    $C$DW$240       .dwtag  DW_TAG_member
    2716                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
    2717                            .dwattr $C$DW$240, DW_AT_name("pui8Data")
    2718                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("pui8Data")
    2719                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2720                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   52

    2721                            .dwattr $C$DW$240, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2722                            .dwattr $C$DW$240, DW_AT_decl_line(0x17f)
    2723                            .dwattr $C$DW$240, DW_AT_decl_column(0x14)
    2724                    
    2725                    $C$DW$241       .dwtag  DW_TAG_member
    2726                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$28)
    2727                            .dwattr $C$DW$241, DW_AT_name("pfnCallback")
    2728                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("pfnCallback")
    2729                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2730                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2731                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2732                            .dwattr $C$DW$241, DW_AT_decl_line(0x184)
    2733                            .dwattr $C$DW$241, DW_AT_decl_column(0x16)
    2734                    
    2735                    $C$DW$242       .dwtag  DW_TAG_member
    2736                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$3)
    2737                            .dwattr $C$DW$242, DW_AT_name("pvCallbackData")
    2738                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("pvCallbackData")
    2739                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2740                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2741                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2742                            .dwattr $C$DW$242, DW_AT_decl_line(0x189)
    2743                            .dwattr $C$DW$242, DW_AT_decl_column(0x0b)
    2744                    
    2745                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2746                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x16b)
    2747                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2748                            .dwendtag $C$DW$T$48
    2749                    
    2750                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2751                            .dwattr $C$DW$T$97, DW_AT_name("tI2CMWrite16BE")
    2752                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$48)
    2753                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2754                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2755                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x18b)
    2756                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2757                    
    2758                    
    2759                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2760                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2761                    $C$DW$243       .dwtag  DW_TAG_member
    2762                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$37)
    2763                            .dwattr $C$DW$243, DW_AT_name("pui8Buffer")
    2764                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("pui8Buffer")
    2765                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2767                            .dwattr $C$DW$243, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2768                            .dwattr $C$DW$243, DW_AT_decl_line(0x58)
    2769                            .dwattr $C$DW$243, DW_AT_decl_column(0x11)
    2770                    
    2771                    $C$DW$244       .dwtag  DW_TAG_member
    2772                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$49)
    2773                            .dwattr $C$DW$244, DW_AT_name("sWriteState")
    2774                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("sWriteState")
    2775                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   53

    2776                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2777                            .dwattr $C$DW$244, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2778                            .dwattr $C$DW$244, DW_AT_decl_line(0x5d)
    2779                            .dwattr $C$DW$244, DW_AT_decl_column(0x15)
    2780                    
    2781                    $C$DW$245       .dwtag  DW_TAG_member
    2782                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$50)
    2783                            .dwattr $C$DW$245, DW_AT_name("sReadModifyWriteState")
    2784                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2785                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2787                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2788                            .dwattr $C$DW$245, DW_AT_decl_line(0x62)
    2789                            .dwattr $C$DW$245, DW_AT_decl_column(0x1f)
    2790                    
    2791                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2792                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2793                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2794                            .dwendtag $C$DW$T$51
    2795                    
    2796                    
    2797                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2798                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2799                    $C$DW$246       .dwtag  DW_TAG_member
    2800                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$52)
    2801                            .dwattr $C$DW$246, DW_AT_name("pui8Buffer")
    2802                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("pui8Buffer")
    2803                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2805                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2806                            .dwattr $C$DW$246, DW_AT_decl_line(0x74)
    2807                            .dwattr $C$DW$246, DW_AT_decl_column(0x11)
    2808                    
    2809                    $C$DW$247       .dwtag  DW_TAG_member
    2810                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$49)
    2811                            .dwattr $C$DW$247, DW_AT_name("sWriteState")
    2812                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("sWriteState")
    2813                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2814                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2815                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2816                            .dwattr $C$DW$247, DW_AT_decl_line(0x79)
    2817                            .dwattr $C$DW$247, DW_AT_decl_column(0x15)
    2818                    
    2819                    $C$DW$248       .dwtag  DW_TAG_member
    2820                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$50)
    2821                            .dwattr $C$DW$248, DW_AT_name("sReadModifyWriteState")
    2822                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2823                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2826                            .dwattr $C$DW$248, DW_AT_decl_line(0x7e)
    2827                            .dwattr $C$DW$248, DW_AT_decl_column(0x1f)
    2828                    
    2829                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2830                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   54

    2831                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2832                            .dwendtag $C$DW$T$53
    2833                    
    2834                    
    2835                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2836                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2837                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2838                    $C$DW$249       .dwtag  DW_TAG_member
    2839                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$23)
    2840                            .dwattr $C$DW$249, DW_AT_name("pucStartAddress")
    2841                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("pucStartAddress")
    2842                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2843                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2844                            .dwattr $C$DW$249, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2845                            .dwattr $C$DW$249, DW_AT_decl_line(0x96)
    2846                            .dwattr $C$DW$249, DW_AT_decl_column(0x0b)
    2847                    
    2848                    $C$DW$250       .dwtag  DW_TAG_member
    2849                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$54)
    2850                            .dwattr $C$DW$250, DW_AT_name("xSizeInBytes")
    2851                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("xSizeInBytes")
    2852                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2853                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2854                            .dwattr $C$DW$250, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2855                            .dwattr $C$DW$250, DW_AT_decl_line(0x97)
    2856                            .dwattr $C$DW$250, DW_AT_decl_column(0x09)
    2857                    
    2858                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2859                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2860                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2861                            .dwendtag $C$DW$T$55
    2862                    
    2863                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2864                            .dwattr $C$DW$T$98, DW_AT_name("HeapRegion_t")
    2865                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$55)
    2866                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2867                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2868                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x98)
    2869                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2870                    
    2871                    
    2872                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2873                            .dwattr $C$DW$T$56, DW_AT_name("ReportData_Item")
    2874                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x18)
    2875                    $C$DW$251       .dwtag  DW_TAG_member
    2876                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    2877                            .dwattr $C$DW$251, DW_AT_name("TimeStamp")
    2878                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("TimeStamp")
    2879                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2880                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2881                            .dwattr $C$DW$251, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2882                            .dwattr $C$DW$251, DW_AT_decl_line(0x20)
    2883                            .dwattr $C$DW$251, DW_AT_decl_column(0x2b)
    2884                    
    2885                    $C$DW$252       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 11:54:35 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   55

    2886                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$24)
    2887                            .dwattr $C$DW$252, DW_AT_name("ReportName")
    2888                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("ReportName")
    2889                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2890                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2891                            .dwattr $C$DW$252, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2892                            .dwattr $C$DW$252, DW_AT_decl_line(0x21)
    2893                            .dwattr $C$DW$252, DW_AT_decl_column(0x13)
    2894                    
    2895                    $C$DW$253       .dwtag  DW_TAG_member
    2896                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    2897                            .dwattr $C$DW$253, DW_AT_name("ReportValue_0")
    2898                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("ReportValue_0")
    2899                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2900                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2901                            .dwattr $C$DW$253, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2902                            .dwattr $C$DW$253, DW_AT_decl_line(0x22)
    2903                            .dwattr $C$DW$253, DW_AT_decl_column(0x13)
    2904                    
    2905                    $C$DW$254       .dwtag  DW_TAG_member
    2906                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$24)
    2907                            .dwattr $C$DW$254, DW_AT_name("ReportValue_1")
    2908                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("ReportValue_1")
    2909                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2910                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2911                            .dwattr $C$DW$254, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2912                            .dwattr $C$DW$254, DW_AT_decl_line(0x23)
    2913                            .dwattr $C$DW$254, DW_AT_decl_column(0x13)
    2914                    
    2915                    $C$DW$255       .dwtag  DW_TAG_member
    2916                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$24)
    2917                            .dwattr $C$DW$255, DW_AT_name("ReportValue_2")
    2918                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("ReportValue_2")
    2919                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2920                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2921                            .dwattr $C$DW$255, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2922                            .dwattr $C$DW$255, DW_AT_decl_line(0x24)
    2923                            .dwattr $C$DW$255, DW_AT_decl_column(0x13)
    2924                    
    2925                    $C$DW$256       .dwtag  DW_TAG_member
