TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Tue Oct 04 13:55:37 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Magnetometer.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("vTaskDelay")

    1552                            .dwattr $C$DW$154, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1553                            .dwattr $C$DW$154, DW_AT_decl_line(0x7e)
    1554                            .dwattr $C$DW$154, DW_AT_decl_column(0x02)
    1555                    
    1556                    $C$DW$155       .dwtag  DW_TAG_enumerator
    1557                            .dwattr $C$DW$155, DW_AT_name("eSetValueWithOverwrite")
    1558                            .dwattr $C$DW$155, DW_AT_const_value(0x03)
    1559                            .dwattr $C$DW$155, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1560                            .dwattr $C$DW$155, DW_AT_decl_line(0x7f)
    1561                            .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    1562                    
    1563                    $C$DW$156       .dwtag  DW_TAG_enumerator
    1564                            .dwattr $C$DW$156, DW_AT_name("eSetValueWithoutOverwrite")
    1565                            .dwattr $C$DW$156, DW_AT_const_value(0x04)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   31

    1566                            .dwattr $C$DW$156, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1567                            .dwattr $C$DW$156, DW_AT_decl_line(0x80)
    1568                            .dwattr $C$DW$156, DW_AT_decl_column(0x02)
    1569                    
    1570                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1571                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x7b)
    1572                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    1573                            .dwendtag $C$DW$T$84
    1574                    
    1575                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1576                            .dwattr $C$DW$T$85, DW_AT_name("eNotifyAction")
    1577                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1578                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1579                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1580                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x81)
    1581                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1582                    
    1583                    
    1584                    $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
    1585                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
    1586                    $C$DW$157       .dwtag  DW_TAG_enumerator
    1587                            .dwattr $C$DW$157, DW_AT_name("eAbortSleep")
    1588                            .dwattr $C$DW$157, DW_AT_const_value(0x00)
    1589                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1590                            .dwattr $C$DW$157, DW_AT_decl_line(0xb5)
    1591                            .dwattr $C$DW$157, DW_AT_decl_column(0x02)
    1592                    
    1593                    $C$DW$158       .dwtag  DW_TAG_enumerator
    1594                            .dwattr $C$DW$158, DW_AT_name("eStandardSleep")
    1595                            .dwattr $C$DW$158, DW_AT_const_value(0x01)
    1596                            .dwattr $C$DW$158, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1597                            .dwattr $C$DW$158, DW_AT_decl_line(0xb6)
    1598                            .dwattr $C$DW$158, DW_AT_decl_column(0x02)
    1599                    
    1600                    $C$DW$159       .dwtag  DW_TAG_enumerator
    1601                            .dwattr $C$DW$159, DW_AT_name("eNoTasksWaitingTimeout")
    1602                            .dwattr $C$DW$159, DW_AT_const_value(0x02)
    1603                            .dwattr $C$DW$159, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1604                            .dwattr $C$DW$159, DW_AT_decl_line(0xb7)
    1605                            .dwattr $C$DW$159, DW_AT_decl_column(0x02)
    1606                    
    1607                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1608                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xb4)
    1609                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1610                            .dwendtag $C$DW$T$86
    1611                    
    1612                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    1613                            .dwattr $C$DW$T$87, DW_AT_name("eSleepModeStatus")
    1614                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1615                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1616                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1617                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xb8)
    1618                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    1619                    
    1620                    
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   32

    1621                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1622                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1623                    $C$DW$160       .dwtag  DW_TAG_member
    1624                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1625                            .dwattr $C$DW$160, DW_AT_name("ui8Addr")
    1626                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("ui8Addr")
    1627                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1629                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1630                            .dwattr $C$DW$160, DW_AT_decl_line(0x4c)
    1631                            .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    1632                    
    1633                    $C$DW$161       .dwtag  DW_TAG_member
    1634                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    1635                            .dwattr $C$DW$161, DW_AT_name("pui8WriteData")
    1636                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pui8WriteData")
    1637                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1638                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1639                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1640                            .dwattr $C$DW$161, DW_AT_decl_line(0x51)
    1641                            .dwattr $C$DW$161, DW_AT_decl_column(0x14)
    1642                    
    1643                    $C$DW$162       .dwtag  DW_TAG_member
    1644                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    1645                            .dwattr $C$DW$162, DW_AT_name("ui16WriteCount")
    1646                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ui16WriteCount")
    1647                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1648                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1650                            .dwattr $C$DW$162, DW_AT_decl_line(0x56)
    1651                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    1652                    
    1653                    $C$DW$163       .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    1655                            .dwattr $C$DW$163, DW_AT_name("ui16WriteBatchSize")
    1656                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1657                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1658                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1659                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1660                            .dwattr $C$DW$163, DW_AT_decl_line(0x5b)
    1661                            .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    1662                    
    1663                    $C$DW$164       .dwtag  DW_TAG_member
    1664                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    1665                            .dwattr $C$DW$164, DW_AT_name("pui8ReadData")
    1666                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("pui8ReadData")
    1667                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1668                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1669                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1670                            .dwattr $C$DW$164, DW_AT_decl_line(0x60)
    1671                            .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1672                    
    1673                    $C$DW$165       .dwtag  DW_TAG_member
    1674                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    1675                            .dwattr $C$DW$165, DW_AT_name("ui16ReadCount")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   33

    1676                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("ui16ReadCount")
    1677                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1678                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1679                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1680                            .dwattr $C$DW$165, DW_AT_decl_line(0x65)
    1681                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1682                    
    1683                    $C$DW$166       .dwtag  DW_TAG_member
    1684                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1685                            .dwattr $C$DW$166, DW_AT_name("ui16ReadBatchSize")
    1686                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1687                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1688                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1689                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1690                            .dwattr $C$DW$166, DW_AT_decl_line(0x6a)
    1691                            .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    1692                    
    1693                    $C$DW$167       .dwtag  DW_TAG_member
    1694                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$28)
    1695                            .dwattr $C$DW$167, DW_AT_name("pfnCallback")
    1696                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pfnCallback")
    1697                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1698                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1699                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1700                            .dwattr $C$DW$167, DW_AT_decl_line(0x6f)
    1701                            .dwattr $C$DW$167, DW_AT_decl_column(0x16)
    1702                    
    1703                    $C$DW$168       .dwtag  DW_TAG_member
    1704                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$3)
    1705                            .dwattr $C$DW$168, DW_AT_name("pvCallbackData")
    1706                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pvCallbackData")
    1707                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1708                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1710                            .dwattr $C$DW$168, DW_AT_decl_line(0x74)
    1711                            .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    1712                    
    1713                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1714                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1715                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1716                            .dwendtag $C$DW$T$29
    1717                    
    1718                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1719                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1720                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1721                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1722                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1723                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1724                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1725                    
    1726                    
    1727                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    1728                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1729                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1730                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   34

    1731                    $C$DW$169       .dwtag  DW_TAG_subrange_type
    1732                            .dwattr $C$DW$169, DW_AT_upper_bound(0x09)
    1733                    
    1734                            .dwendtag $C$DW$T$31
    1735                    
    1736                    
    1737                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1738                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1739                    $C$DW$170       .dwtag  DW_TAG_member
    1740                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$24)
    1741                            .dwattr $C$DW$170, DW_AT_name("ui32Base")
    1742                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ui32Base")
    1743                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1745                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1746                            .dwattr $C$DW$170, DW_AT_decl_line(0x82)
    1747                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1748                    
    1749                    $C$DW$171       .dwtag  DW_TAG_member
    1750                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1751                            .dwattr $C$DW$171, DW_AT_name("ui8Int")
    1752                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui8Int")
    1753                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1754                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1755                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1756                            .dwattr $C$DW$171, DW_AT_decl_line(0x87)
    1757                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    1758                    
    1759                    $C$DW$172       .dwtag  DW_TAG_member
    1760                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1761                            .dwattr $C$DW$172, DW_AT_name("ui8TxDMA")
    1762                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui8TxDMA")
    1763                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1764                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1765                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1766                            .dwattr $C$DW$172, DW_AT_decl_line(0x8c)
    1767                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    1768                    
    1769                    $C$DW$173       .dwtag  DW_TAG_member
    1770                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1771                            .dwattr $C$DW$173, DW_AT_name("ui8RxDMA")
    1772                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ui8RxDMA")
    1773                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1774                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1775                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1776                            .dwattr $C$DW$173, DW_AT_decl_line(0x91)
    1777                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    1778                    
    1779                    $C$DW$174       .dwtag  DW_TAG_member
    1780                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1781                            .dwattr $C$DW$174, DW_AT_name("ui8State")
    1782                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui8State")
    1783                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1784                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1785                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   35

    1786                            .dwattr $C$DW$174, DW_AT_decl_line(0x96)
    1787                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    1788                    
    1789                    $C$DW$175       .dwtag  DW_TAG_member
    1790                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1791                            .dwattr $C$DW$175, DW_AT_name("ui8ReadPtr")
    1792                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui8ReadPtr")
    1793                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1794                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1795                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1796                            .dwattr $C$DW$175, DW_AT_decl_line(0x9c)
    1797                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    1798                    
    1799                    $C$DW$176       .dwtag  DW_TAG_member
    1800                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1801                            .dwattr $C$DW$176, DW_AT_name("ui8WritePtr")
    1802                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ui8WritePtr")
    1803                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1804                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1805                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1806                            .dwattr $C$DW$176, DW_AT_decl_line(0xa2)
    1807                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    1808                    
    1809                    $C$DW$177       .dwtag  DW_TAG_member
    1810                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    1811                            .dwattr $C$DW$177, DW_AT_name("ui16Index")
    1812                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui16Index")
    1813                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1814                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1815                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1816                            .dwattr $C$DW$177, DW_AT_decl_line(0xa7)
    1817                            .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    1818                    
    1819                    $C$DW$178       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1821                            .dwattr $C$DW$178, DW_AT_name("pCommands")
    1822                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pCommands")
    1823                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1824                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1825                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1826                            .dwattr $C$DW$178, DW_AT_decl_line(0xac)
    1827                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    1828                    
    1829                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1830                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    1831                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1832                            .dwendtag $C$DW$T$32
    1833                    
    1834                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    1835                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    1836                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1837                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1838                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1839                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    1840                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   36

    1841                    
    1842                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1843                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1844                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1845                    
    1846                    
    1847                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1848                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    1849                    $C$DW$179       .dwtag  DW_TAG_member
    1850                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$34)
    1851                            .dwattr $C$DW$179, DW_AT_name("psI2CInst")
    1852                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("psI2CInst")
    1853                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1855                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1856                            .dwattr $C$DW$179, DW_AT_decl_line(0xf0)
    1857                            .dwattr $C$DW$179, DW_AT_decl_column(0x14)
    1858                    
    1859                    $C$DW$180       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$35)
    1861                            .dwattr $C$DW$180, DW_AT_name("pui8Buffer")
    1862                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pui8Buffer")
    1863                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1864                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1865                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1866                            .dwattr $C$DW$180, DW_AT_decl_line(0xf5)
    1867                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    1868                    
    1869                    $C$DW$181       .dwtag  DW_TAG_member
    1870                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1871                            .dwattr $C$DW$181, DW_AT_name("ui8State")
    1872                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8State")
    1873                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1874                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1875                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1876                            .dwattr $C$DW$181, DW_AT_decl_line(0xfa)
    1877                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    1878                    
    1879                    $C$DW$182       .dwtag  DW_TAG_member
    1880                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1881                            .dwattr $C$DW$182, DW_AT_name("ui8Addr")
    1882                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui8Addr")
    1883                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1884                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1885                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1886                            .dwattr $C$DW$182, DW_AT_decl_line(0xff)
    1887                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    1888                    
    1889                    $C$DW$183       .dwtag  DW_TAG_member
    1890                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    1891                            .dwattr $C$DW$183, DW_AT_name("ui16Mask")
    1892                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui16Mask")
    1893                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1894                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1895                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   37

    1896                            .dwattr $C$DW$183, DW_AT_decl_line(0x104)
    1897                            .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    1898                    
    1899                    $C$DW$184       .dwtag  DW_TAG_member
    1900                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    1901                            .dwattr $C$DW$184, DW_AT_name("ui16Value")
    1902                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui16Value")
    1903                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1904                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1905                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1906                            .dwattr $C$DW$184, DW_AT_decl_line(0x109)
    1907                            .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    1908                    
    1909                    $C$DW$185       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$28)
    1911                            .dwattr $C$DW$185, DW_AT_name("pfnCallback")
    1912                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("pfnCallback")
    1913                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1914                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1916                            .dwattr $C$DW$185, DW_AT_decl_line(0x10f)
    1917                            .dwattr $C$DW$185, DW_AT_decl_column(0x16)
    1918                    
    1919                    $C$DW$186       .dwtag  DW_TAG_member
    1920                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$3)
    1921                            .dwattr $C$DW$186, DW_AT_name("pvCallbackData")
    1922                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("pvCallbackData")
    1923                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1924                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1925                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1926                            .dwattr $C$DW$186, DW_AT_decl_line(0x114)
    1927                            .dwattr $C$DW$186, DW_AT_decl_column(0x0b)
    1928                    
    1929                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1930                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    1931                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1932                            .dwendtag $C$DW$T$36
    1933                    
    1934                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1935                            .dwattr $C$DW$T$88, DW_AT_name("tI2CMReadModifyWrite16")
    1936                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$36)
    1937                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1938                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1939                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x116)
    1940                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x01)
    1941                    
    1942                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    1943                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1944                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    1945                    
    1946                    
    1947                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1948                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    1949                    $C$DW$187       .dwtag  DW_TAG_member
    1950                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$34)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   38

    1951                            .dwattr $C$DW$187, DW_AT_name("psI2CInst")
    1952                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("psI2CInst")
    1953                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1956                            .dwattr $C$DW$187, DW_AT_decl_line(0x123)
    1957                            .dwattr $C$DW$187, DW_AT_decl_column(0x14)
    1958                    
    1959                    $C$DW$188       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$37)
    1961                            .dwattr $C$DW$188, DW_AT_name("pui8Buffer")
    1962                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("pui8Buffer")
    1963                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1964                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1966                            .dwattr $C$DW$188, DW_AT_decl_line(0x128)
    1967                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    1968                    
    1969                    $C$DW$189       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    1971                            .dwattr $C$DW$189, DW_AT_name("ui16Count")
    1972                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui16Count")
    1973                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1974                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1976                            .dwattr $C$DW$189, DW_AT_decl_line(0x12d)
    1977                            .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    1978                    
    1979                    $C$DW$190       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    1981                            .dwattr $C$DW$190, DW_AT_name("pui8Data")
    1982                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("pui8Data")
    1983                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1984                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1986                            .dwattr $C$DW$190, DW_AT_decl_line(0x132)
    1987                            .dwattr $C$DW$190, DW_AT_decl_column(0x14)
    1988                    
    1989                    $C$DW$191       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$28)
    1991                            .dwattr $C$DW$191, DW_AT_name("pfnCallback")
    1992                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("pfnCallback")
    1993                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1994                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1996                            .dwattr $C$DW$191, DW_AT_decl_line(0x137)
    1997                            .dwattr $C$DW$191, DW_AT_decl_column(0x16)
    1998                    
    1999                    $C$DW$192       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$3)
    2001                            .dwattr $C$DW$192, DW_AT_name("pvCallbackData")
    2002                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pvCallbackData")
    2003                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2004                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   39

    2006                            .dwattr $C$DW$192, DW_AT_decl_line(0x13c)
    2007                            .dwattr $C$DW$192, DW_AT_decl_column(0x0b)
    2008                    
    2009                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2010                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2011                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2012                            .dwendtag $C$DW$T$38
    2013                    
    2014                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    2015                            .dwattr $C$DW$T$47, DW_AT_name("tI2CMWrite8")
    2016                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$38)
    2017                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    2018                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2019                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x13e)
    2020                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2021                    
    2022                    
    2023                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2024                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2025                    $C$DW$193       .dwtag  DW_TAG_member
    2026                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$34)
    2027                            .dwattr $C$DW$193, DW_AT_name("psI2CInst")
    2028                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("psI2CInst")
    2029                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2031                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2032                            .dwattr $C$DW$193, DW_AT_decl_line(0xbc)
    2033                            .dwattr $C$DW$193, DW_AT_decl_column(0x14)
    2034                    
    2035                    $C$DW$194       .dwtag  DW_TAG_member
    2036                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$35)
    2037                            .dwattr $C$DW$194, DW_AT_name("pui8Buffer")
    2038                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pui8Buffer")
    2039                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2040                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2041                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2042                            .dwattr $C$DW$194, DW_AT_decl_line(0xc1)
    2043                            .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    2044                    
    2045                    $C$DW$195       .dwtag  DW_TAG_member
    2046                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2047                            .dwattr $C$DW$195, DW_AT_name("ui8State")
    2048                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui8State")
    2049                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2050                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2052                            .dwattr $C$DW$195, DW_AT_decl_line(0xc6)
    2053                            .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    2054                    
    2055                    $C$DW$196       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2057                            .dwattr $C$DW$196, DW_AT_name("ui8Addr")
    2058                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui8Addr")
    2059                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2060                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   40

    2061                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2062                            .dwattr $C$DW$196, DW_AT_decl_line(0xcb)
    2063                            .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    2064                    
    2065                    $C$DW$197       .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2067                            .dwattr $C$DW$197, DW_AT_name("ui8Mask")
    2068                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("ui8Mask")
    2069                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2070                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2072                            .dwattr $C$DW$197, DW_AT_decl_line(0xd0)
    2073                            .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2074                    
    2075                    $C$DW$198       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2077                            .dwattr $C$DW$198, DW_AT_name("ui8Value")
    2078                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ui8Value")
    2079                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2080                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2081                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2082                            .dwattr $C$DW$198, DW_AT_decl_line(0xd5)
    2083                            .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    2084                    
    2085                    $C$DW$199       .dwtag  DW_TAG_member
    2086                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$28)
    2087                            .dwattr $C$DW$199, DW_AT_name("pfnCallback")
    2088                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pfnCallback")
    2089                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2090                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2091                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2092                            .dwattr $C$DW$199, DW_AT_decl_line(0xdb)
    2093                            .dwattr $C$DW$199, DW_AT_decl_column(0x16)
    2094                    
    2095                    $C$DW$200       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$3)
    2097                            .dwattr $C$DW$200, DW_AT_name("pvCallbackData")
    2098                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pvCallbackData")
    2099                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2100                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2102                            .dwattr $C$DW$200, DW_AT_decl_line(0xe0)
    2103                            .dwattr $C$DW$200, DW_AT_decl_column(0x0b)
    2104                    
    2105                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2106                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2107                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2108                            .dwendtag $C$DW$T$39
    2109                    
    2110                    $C$DW$T$48      .dwtag  DW_TAG_typedef
    2111                            .dwattr $C$DW$T$48, DW_AT_name("tI2CMReadModifyWrite8")
    2112                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$39)
    2113                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2114                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2115                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xe2)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   41

    2116                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2117                    
    2118                    
    2119                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2120                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2121                    $C$DW$201       .dwtag  DW_TAG_member
    2122                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$34)
    2123                            .dwattr $C$DW$201, DW_AT_name("psI2CInst")
    2124                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("psI2CInst")
    2125                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2127                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2128                            .dwattr $C$DW$201, DW_AT_decl_line(0x32)
    2129                            .dwattr $C$DW$201, DW_AT_decl_column(0x14)
    2130                    
    2131                    $C$DW$202       .dwtag  DW_TAG_member
    2132                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2133                            .dwattr $C$DW$202, DW_AT_name("ui8Addr")
    2134                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ui8Addr")
    2135                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2136                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2137                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2138                            .dwattr $C$DW$202, DW_AT_decl_line(0x37)
    2139                            .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2140                    
    2141                    $C$DW$203       .dwtag  DW_TAG_member
    2142                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2143                            .dwattr $C$DW$203, DW_AT_name("ui8State")
    2144                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ui8State")
    2145                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2146                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2147                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2148                            .dwattr $C$DW$203, DW_AT_decl_line(0x3c)
    2149                            .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2150                    
    2151                    $C$DW$204       .dwtag  DW_TAG_member
    2152                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$40)
    2153                            .dwattr $C$DW$204, DW_AT_name("pui8Data")
    2154                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pui8Data")
    2155                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2156                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2158                            .dwattr $C$DW$204, DW_AT_decl_line(0x41)
    2159                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2160                    
    2161                    $C$DW$205       .dwtag  DW_TAG_member
    2162                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$28)
    2163                            .dwattr $C$DW$205, DW_AT_name("pfnCallback")
    2164                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("pfnCallback")
    2165                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2166                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2167                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2168                            .dwattr $C$DW$205, DW_AT_decl_line(0x47)
    2169                            .dwattr $C$DW$205, DW_AT_decl_column(0x16)
    2170                    
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   42

    2171                    $C$DW$206       .dwtag  DW_TAG_member
    2172                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$3)
    2173                            .dwattr $C$DW$206, DW_AT_name("pvCallbackData")
    2174                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pvCallbackData")
    2175                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2176                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2177                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2178                            .dwattr $C$DW$206, DW_AT_decl_line(0x4c)
    2179                            .dwattr $C$DW$206, DW_AT_decl_column(0x0b)
    2180                    
    2181                    $C$DW$207       .dwtag  DW_TAG_member
    2182                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$49)
    2183                            .dwattr $C$DW$207, DW_AT_name("uCommand")
    2184                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("uCommand")
    2185                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2186                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2187                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2188                            .dwattr $C$DW$207, DW_AT_decl_line(0x64)
    2189                            .dwattr $C$DW$207, DW_AT_decl_column(0x05)
    2190                    
    2191                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2192                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2193                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2194                            .dwendtag $C$DW$T$41
    2195                    
    2196                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2197                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2198                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2199                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2200                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2201                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2202                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2203                    
    2204                    
    2205                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2206                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2207                    $C$DW$208       .dwtag  DW_TAG_member
    2208                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$34)
    2209                            .dwattr $C$DW$208, DW_AT_name("psI2CInst")
    2210                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("psI2CInst")
    2211                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2213                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2214                            .dwattr $C$DW$208, DW_AT_decl_line(0x33)
    2215                            .dwattr $C$DW$208, DW_AT_decl_column(0x14)
    2216                    
    2217                    $C$DW$209       .dwtag  DW_TAG_member
    2218                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    2219                            .dwattr $C$DW$209, DW_AT_name("sAK8975Inst")
    2220                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("sAK8975Inst")
    2221                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2222                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2223                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2224                            .dwattr $C$DW$209, DW_AT_decl_line(0x38)
    2225                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   43

    2226                    
    2227                    $C$DW$210       .dwtag  DW_TAG_member
    2228                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2229                            .dwattr $C$DW$210, DW_AT_name("ui8Addr")
    2230                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("ui8Addr")
    2231                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2232                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2233                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2234                            .dwattr $C$DW$210, DW_AT_decl_line(0x3d)
    2235                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2236                    
    2237                    $C$DW$211       .dwtag  DW_TAG_member
    2238                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2239                            .dwattr $C$DW$211, DW_AT_name("ui8State")
    2240                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("ui8State")
    2241                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2242                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2243                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2244                            .dwattr $C$DW$211, DW_AT_decl_line(0x42)
    2245                            .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    2246                    
    2247                    $C$DW$212       .dwtag  DW_TAG_member
    2248                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2249                            .dwattr $C$DW$212, DW_AT_name("ui8AccelAfsSel")
    2250                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2251                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2252                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2253                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2254                            .dwattr $C$DW$212, DW_AT_decl_line(0x47)
    2255                            .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    2256                    
    2257                    $C$DW$213       .dwtag  DW_TAG_member
    2258                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2259                            .dwattr $C$DW$213, DW_AT_name("ui8NewAccelAfsSel")
    2260                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2261                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2262                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2263                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2264                            .dwattr $C$DW$213, DW_AT_decl_line(0x4d)
    2265                            .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    2266                    
    2267                    $C$DW$214       .dwtag  DW_TAG_member
    2268                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2269                            .dwattr $C$DW$214, DW_AT_name("ui8GyroFsSel")
    2270                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2271                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2272                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2273                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2274                            .dwattr $C$DW$214, DW_AT_decl_line(0x52)
    2275                            .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    2276                    
    2277                    $C$DW$215       .dwtag  DW_TAG_member
    2278                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2279                            .dwattr $C$DW$215, DW_AT_name("ui8NewGyroFsSel")
    2280                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   44

    2281                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2282                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2283                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2284                            .dwattr $C$DW$215, DW_AT_decl_line(0x58)
    2285                            .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2286                    
    2287                    $C$DW$216       .dwtag  DW_TAG_member
    2288                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$43)
    2289                            .dwattr $C$DW$216, DW_AT_name("pui8Data")
    2290                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("pui8Data")
    2291                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2292                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2294                            .dwattr $C$DW$216, DW_AT_decl_line(0x5d)
    2295                            .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2296                    
    2297                    $C$DW$217       .dwtag  DW_TAG_member
    2298                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$28)
    2299                            .dwattr $C$DW$217, DW_AT_name("pfnCallback")
    2300                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("pfnCallback")
    2301                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2302                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2303                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2304                            .dwattr $C$DW$217, DW_AT_decl_line(0x63)
    2305                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2306                    
    2307                    $C$DW$218       .dwtag  DW_TAG_member
    2308                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$3)
    2309                            .dwattr $C$DW$218, DW_AT_name("pvCallbackData")
    2310                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pvCallbackData")
    2311                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2312                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2313                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2314                            .dwattr $C$DW$218, DW_AT_decl_line(0x68)
    2315                            .dwattr $C$DW$218, DW_AT_decl_column(0x0b)
    2316                    
    2317                    $C$DW$219       .dwtag  DW_TAG_member
    2318                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$51)
    2319                            .dwattr $C$DW$219, DW_AT_name("uCommand")
    2320                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("uCommand")
    2321                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2322                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2323                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2324                            .dwattr $C$DW$219, DW_AT_decl_line(0x80)
    2325                            .dwattr $C$DW$219, DW_AT_decl_column(0x05)
    2326                    
    2327                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2328                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2329                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2330                            .dwendtag $C$DW$T$44
    2331                    
    2332                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    2333                            .dwattr $C$DW$T$90, DW_AT_name("tMPU9150")
    2334                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$44)
    2335                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   45

    2336                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2337                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x82)
    2338                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x01)
    2339                    
    2340                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    2341                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2342                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    2343                    
    2344                    
    2345                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2346                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
    2347                    $C$DW$220       .dwtag  DW_TAG_member
    2348                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$34)
    2349                            .dwattr $C$DW$220, DW_AT_name("psI2CInst")
    2350                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("psI2CInst")
    2351                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2353                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2354                            .dwattr $C$DW$220, DW_AT_decl_line(0x14c)
    2355                            .dwattr $C$DW$220, DW_AT_decl_column(0x14)
    2356                    
    2357                    $C$DW$221       .dwtag  DW_TAG_member
    2358                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$23)
    2359                            .dwattr $C$DW$221, DW_AT_name("pui8Data")
    2360                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("pui8Data")
    2361                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2362                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2363                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2364                            .dwattr $C$DW$221, DW_AT_decl_line(0x151)
    2365                            .dwattr $C$DW$221, DW_AT_decl_column(0x0e)
    2366                    
    2367                    $C$DW$222       .dwtag  DW_TAG_member
    2368                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    2369                            .dwattr $C$DW$222, DW_AT_name("ui16Count")
    2370                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("ui16Count")
    2371                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2372                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2373                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2374                            .dwattr $C$DW$222, DW_AT_decl_line(0x156)
    2375                            .dwattr $C$DW$222, DW_AT_decl_column(0x0e)
    2376                    
    2377                    $C$DW$223       .dwtag  DW_TAG_member
    2378                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$28)
    2379                            .dwattr $C$DW$223, DW_AT_name("pfnCallback")
    2380                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("pfnCallback")
    2381                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2382                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2383                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2384                            .dwattr $C$DW$223, DW_AT_decl_line(0x15b)
    2385                            .dwattr $C$DW$223, DW_AT_decl_column(0x16)
    2386                    
    2387                    $C$DW$224       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$3)
    2389                            .dwattr $C$DW$224, DW_AT_name("pvCallbackData")
    2390                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("pvCallbackData")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   46

    2391                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2392                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2394                            .dwattr $C$DW$224, DW_AT_decl_line(0x160)
    2395                            .dwattr $C$DW$224, DW_AT_decl_column(0x0b)
    2396                    
    2397                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2398                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x147)
    2399                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    2400                            .dwendtag $C$DW$T$45
    2401                    
    2402                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    2403                            .dwattr $C$DW$T$92, DW_AT_name("tI2CMRead16BE")
    2404                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$45)
    2405                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2406                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2407                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x162)
    2408                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    2409                    
    2410                    
    2411                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2412                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    2413                    $C$DW$225       .dwtag  DW_TAG_member
    2414                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$34)
    2415                            .dwattr $C$DW$225, DW_AT_name("psI2CInst")
    2416                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("psI2CInst")
    2417                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2418                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2419                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2420                            .dwattr $C$DW$225, DW_AT_decl_line(0x170)
    2421                            .dwattr $C$DW$225, DW_AT_decl_column(0x14)
    2422                    
    2423                    $C$DW$226       .dwtag  DW_TAG_member
    2424                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$37)
    2425                            .dwattr $C$DW$226, DW_AT_name("pui8Buffer")
    2426                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("pui8Buffer")
    2427                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2428                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2429                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2430                            .dwattr $C$DW$226, DW_AT_decl_line(0x175)
    2431                            .dwattr $C$DW$226, DW_AT_decl_column(0x0d)
    2432                    
    2433                    $C$DW$227       .dwtag  DW_TAG_member
    2434                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    2435                            .dwattr $C$DW$227, DW_AT_name("ui16Count")
    2436                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("ui16Count")
    2437                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2438                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2439                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2440                            .dwattr $C$DW$227, DW_AT_decl_line(0x17a)
    2441                            .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    2442                    
    2443                    $C$DW$228       .dwtag  DW_TAG_member
    2444                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    2445                            .dwattr $C$DW$228, DW_AT_name("pui8Data")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   47

    2446                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("pui8Data")
    2447                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2448                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2449                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2450                            .dwattr $C$DW$228, DW_AT_decl_line(0x17f)
    2451                            .dwattr $C$DW$228, DW_AT_decl_column(0x14)
    2452                    
    2453                    $C$DW$229       .dwtag  DW_TAG_member
    2454                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$28)
    2455                            .dwattr $C$DW$229, DW_AT_name("pfnCallback")
    2456                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pfnCallback")
    2457                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2458                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2460                            .dwattr $C$DW$229, DW_AT_decl_line(0x184)
    2461                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2462                    
    2463                    $C$DW$230       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$3)
    2465                            .dwattr $C$DW$230, DW_AT_name("pvCallbackData")
    2466                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("pvCallbackData")
    2467                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2468                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2470                            .dwattr $C$DW$230, DW_AT_decl_line(0x189)
    2471                            .dwattr $C$DW$230, DW_AT_decl_column(0x0b)
    2472                    
    2473                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2474                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x16b)
    2475                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2476                            .dwendtag $C$DW$T$46
    2477                    
    2478                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    2479                            .dwattr $C$DW$T$93, DW_AT_name("tI2CMWrite16BE")
    2480                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$46)
    2481                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2482                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2483                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x18b)
    2484                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2485                    
    2486                    
    2487                    $C$DW$T$49      .dwtag  DW_TAG_union_type
    2488                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
    2489                    $C$DW$231       .dwtag  DW_TAG_member
    2490                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$37)
    2491                            .dwattr $C$DW$231, DW_AT_name("pui8Buffer")
    2492                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("pui8Buffer")
    2493                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2495                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2496                            .dwattr $C$DW$231, DW_AT_decl_line(0x58)
    2497                            .dwattr $C$DW$231, DW_AT_decl_column(0x11)
    2498                    
    2499                    $C$DW$232       .dwtag  DW_TAG_member
    2500                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$47)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   48

    2501                            .dwattr $C$DW$232, DW_AT_name("sWriteState")
    2502                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("sWriteState")
    2503                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2505                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2506                            .dwattr $C$DW$232, DW_AT_decl_line(0x5d)
    2507                            .dwattr $C$DW$232, DW_AT_decl_column(0x15)
    2508                    
    2509                    $C$DW$233       .dwtag  DW_TAG_member
    2510                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$48)
    2511                            .dwattr $C$DW$233, DW_AT_name("sReadModifyWriteState")
    2512                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2513                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2514                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2515                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2516                            .dwattr $C$DW$233, DW_AT_decl_line(0x62)
    2517                            .dwattr $C$DW$233, DW_AT_decl_column(0x1f)
    2518                    
    2519                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2520                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x54)
    2521                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x05)
    2522                            .dwendtag $C$DW$T$49
    2523                    
    2524                    
    2525                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2526                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2527                    $C$DW$234       .dwtag  DW_TAG_member
    2528                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$50)
    2529                            .dwattr $C$DW$234, DW_AT_name("pui8Buffer")
    2530                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("pui8Buffer")
    2531                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2533                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2534                            .dwattr $C$DW$234, DW_AT_decl_line(0x74)
    2535                            .dwattr $C$DW$234, DW_AT_decl_column(0x11)
    2536                    
    2537                    $C$DW$235       .dwtag  DW_TAG_member
    2538                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$47)
    2539                            .dwattr $C$DW$235, DW_AT_name("sWriteState")
    2540                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("sWriteState")
    2541                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2543                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2544                            .dwattr $C$DW$235, DW_AT_decl_line(0x79)
    2545                            .dwattr $C$DW$235, DW_AT_decl_column(0x15)
    2546                    
    2547                    $C$DW$236       .dwtag  DW_TAG_member
    2548                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$48)
    2549                            .dwattr $C$DW$236, DW_AT_name("sReadModifyWriteState")
    2550                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2551                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2552                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2553                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2554                            .dwattr $C$DW$236, DW_AT_decl_line(0x7e)
    2555                            .dwattr $C$DW$236, DW_AT_decl_column(0x1f)
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   49

    2556                    
    2557                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2558                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x70)
    2559                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2560                            .dwendtag $C$DW$T$51
    2561                    
    2562                    
    2563                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2564                            .dwattr $C$DW$T$53, DW_AT_name("HeapRegion")
    2565                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    2566                    $C$DW$237       .dwtag  DW_TAG_member
    2567                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$23)
    2568                            .dwattr $C$DW$237, DW_AT_name("pucStartAddress")
    2569                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("pucStartAddress")
    2570                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2572                            .dwattr $C$DW$237, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2573                            .dwattr $C$DW$237, DW_AT_decl_line(0x96)
    2574                            .dwattr $C$DW$237, DW_AT_decl_column(0x0b)
    2575                    
    2576                    $C$DW$238       .dwtag  DW_TAG_member
    2577                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$52)
    2578                            .dwattr $C$DW$238, DW_AT_name("xSizeInBytes")
    2579                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("xSizeInBytes")
    2580                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2581                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2582                            .dwattr $C$DW$238, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2583                            .dwattr $C$DW$238, DW_AT_decl_line(0x97)
    2584                            .dwattr $C$DW$238, DW_AT_decl_column(0x09)
    2585                    
    2586                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2587                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x94)
    2588                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    2589                            .dwendtag $C$DW$T$53
    2590                    
    2591                    $C$DW$T$94      .dwtag  DW_TAG_typedef
    2592                            .dwattr $C$DW$T$94, DW_AT_name("HeapRegion_t")
    2593                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$53)
    2594                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2595                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2596                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x98)
    2597                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    2598                    
    2599                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2600                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2601                    
    2602                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2603                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2604                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2605                    
    2606                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2607                            .dwattr $C$DW$T$95, DW_AT_name("QueueHandle_t")
    2608                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$3)
    2609                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2610                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\queue.h")
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   50

    2611                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x58)
    2612                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    2613                    
    2614                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2615                            .dwattr $C$DW$T$96, DW_AT_name("SemaphoreHandle_t")
    2616                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    2617                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2618                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/semphr.h")
    2619                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x4f)
    2620                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x17)
    2621                    
    2622                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2623                            .dwattr $C$DW$T$97, DW_AT_name("QueueSetHandle_t")
    2624                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$3)
    2625                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2626                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\queue.h")
    2627                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x5f)
    2628                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x10)
    2629                    
    2630                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2631                            .dwattr $C$DW$T$98, DW_AT_name("QueueSetMemberHandle_t")
    2632                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$3)
    2633                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2634                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\queue.h")
    2635                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x66)
    2636                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x10)
    2637                    
    2638                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    2639                            .dwattr $C$DW$T$77, DW_AT_name("TaskHandle_t")
    2640                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$3)
    2641                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2642                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    2643                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x67)
    2644                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
    2645                    
    2646                    
    2647                    $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2648                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2649                    $C$DW$239       .dwtag  DW_TAG_formal_parameter
    2650                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$3)
    2651                    
    2652                    $C$DW$240       .dwtag  DW_TAG_formal_parameter
    2653                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$25)
    2654                    
    2655                            .dwendtag $C$DW$T$26
    2656                    
    2657                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    2658                            .dwattr $C$DW$T$27, DW_AT_name("tSensorCallback")
    2659                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2660                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2661                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2662                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2c)
    2663                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
    2664                    
    2665                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   51

    2666                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2667                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    2668                    
    2669                    
    2670                    $C$DW$T$65      .dwtag  DW_TAG_subroutine_type
    2671                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2672                    $C$DW$241       .dwtag  DW_TAG_formal_parameter
    2673                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$3)
    2674                    
    2675                            .dwendtag $C$DW$T$65
    2676                    
    2677                    $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    2678                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    2679                            .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    2680                    
    2681                    $C$DW$T$67      .dwtag  DW_TAG_typedef
    2682                            .dwattr $C$DW$T$67, DW_AT_name("TaskFunction_t")
    2683                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2684                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2685                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\projdefs.h")
    2686                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x4d)
    2687                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x10)
    2688                    
    2689                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2690                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2691                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2692                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2693                    
    2694                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2695                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2696                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2697                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2698                    
    2699                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    2700                            .dwattr $C$DW$T$112, DW_AT_name("int8_t")
    2701                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$5)
    2702                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2703                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2704                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x2a)
    2705                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x1d)
    2706                    
    2707                    $C$DW$T$113     .dwtag  DW_TAG_typedef
    2708                            .dwattr $C$DW$T$113, DW_AT_name("int_least8_t")
    2709                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    2710                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2711                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2712                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x37)
    2713                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    2714                    
    2715                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2716                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2717                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2718                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2719                    
    2720                    $C$DW$T$19      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v15.12.1 Tue Oct 04 13:55:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   52

    2721                            .dwattr $C$DW$T$19, DW_AT_name("uint8_t")
    2722                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    2723                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2724                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2725                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    2726                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    2727                    
    2728                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    2729                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    2730                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    2731                    
    2732                    
    2733                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    2734                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    2735                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2736                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    2737                    $C$DW$242       .dwtag  DW_TAG_subrange_type
    2738                            .dwattr $C$DW$242, DW_AT_upper_bound(0x03)
    2739                    
    2740                            .dwendtag $C$DW$T$35
    2741                    
    2742                    
    2743                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    2744                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
    2745                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
